app/Controllers/LineasTelefonicasController.php

    public function index(): string
    {
        $lineas = new LineasTelefonicasModel();
        $datos['datos'] = $lineas->findAll();
---
SELECT *
FROM `lineas_telefonicas`

    public function buscarLinea($id=null)
    {
        $lineas = new LineasTelefonicasModel();
        $datos['datos']=$lineas->where('no_telefono',$id)->first();
---
SELECT *
FROM `lineas_telefonicas`
WHERE `no_telefono` = '41404301'
 LIMIT 1