app/Controllers/PlanesController.php

    public function index(): string
    {

        $planes = new PlanesModel();
        $datos['datos']=$planes->findAll();
---
SELECT *
FROM `planes`

    public function buscarPlan($id=null)
    {
        //echo $id;
        $planes = new PlanesModel();
        //select * from planes where plan_id=$id;
        $datos['datos']=$planes->where('plan_id',$id)->first();
---
SELECT *
FROM `planes`
WHERE `plan_id` = '0'
 LIMIT 1